soap-service/soap-request.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://server.soap.example.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:add>
         <arg0>5</arg0>
         <arg1>3</arg1>
      </ser:add>
      <ser:subtract>
         <arg0>10</arg0>
         <arg1>4</arg1>
      </ser:subtract>
      <ser:multiply>
         <arg0>6</arg0>
         <arg1>7</arg1>
      </ser:multiply>
      <ser:divide>
         <arg0>20</arg0>
         <arg1>5</arg1>
      </ser:divide>
   </soapenv:Body>
</soapenv:Envelope>
